---
kind: method
id: M:Autodesk.Revit.UI.UIApplication.#ctor(Autodesk.Revit.ApplicationServices.Application)
source: html/e7ef0309-6d98-90f8-227f-8a670bbb5558.htm
---
# Autodesk.Revit.UI.UIApplication.#ctor Method

Use a database level Application to construct a UI-level Application.

## Syntax (C#)
```csharp
public UIApplication(
	Application revitApp
)
```

## Parameters
- **revitApp** (`Autodesk.Revit.ApplicationServices.Application`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the Application argument is a null pointer.